#############################################################
#                                                           #
#                   Практическое занятие 4                  #
#                                                           #
#############################################################

# Создадим ряд переменным, которые понядобятся далее

gender <- c('male', 'male',
            'female', 'female',
            'male', 'female',
            'male')

x <- c(170, 180, 172, 163, 192, 201, 177)  # ~ рост
w <- c(78, 83, 62, 66, 91, 55, 66)         # ~ вес


#### Логические операторы #####

# Прежде чем обратиться к логическим операторам - есть смысл разобрать
# индексацию векторов. 
# Не стоит пугаться данного словосочетания. На самом деле имеется ввиду
# обращение к конкретным элементам векторов используя их порядковые
# номера - индексы. Обращения к элементам векторов производятся с помощью
# квадратных скобочек

x[3]                   # Извлечь 3 элемент
x[2:6]                 # Извлечь элементы со 2 по 6

# Помимо использования конкретных индексов внутри квадратных скобочек
# можно пользоваться любыми арифметическими и логическими операторами

x[x > 170]             # Извлечь все элементы больше 170
x[x < 170]             # Извлечь все элементы меньше 170
x[x == 170]            # Извлечь все элементы равные 170
x[x >= 170]            # Извлечь все элементы, которые больше или равны 170
x[x <= 170]            # Извлечь все элементы, которые меньше или равны 170
x[x != 170]            # Извлечь все элементы неравные 170

# Можно проверить сам факт наличия конкретной переменной в векторе

170 %in% x 

# В дальнейшейм, эта конструкция будет использоваться для проверки
# наличия векторов в матрица, конкретных данных в таблицах и много
# где ещё. В общем - полезно знать заранее

# Логические операторы довольно просты в использовании и не сложны в 
# запоминании
#     
#     & - И
#     | - ИЛИ
#     ! - НЕ


x[x > 170 & x < 190]   
x[x > 170 | !(x < 190)]

# Помимо того, что логические операции можно использовать для отдельных
# векторов, их можно использовать и для нескольких. Концептуально, это
# похоже на работу с таблицами, где каждый вектор - это столбец, а каждый
# отдельный элемент вектора представляет строку

((x < 180) | !(w <= 70)) & (gender =='female' | m == 'S')


#### Условная конструкция if / else ####

# Логические операторы, разобранные ранее являются крайне полезными 
# для того, чтобы использовать их в конструкции if / else
# В общем виде конструкция выглядит следующим образом:

if(условие){исход 1} else {исход 2} 

# В полном виде (представлено ниже) конструкция используется для
# конкретных элементов вектора, однако в дальнейшем мы разберём,
# как её можно использовать для автоматизации проверки

if(gender[1] == 'female'){
  print('Это женщина')
} else {
  print('Это мужчина')
}

# Также, есть функция ifelse(), которая позволяет использовать
# условные конструкции для всех элементов вектора и получать
# на выходе вектор логических значений

ifelse(gender=='female', 'Это женщина', "Это мужчина")

#### Data frames. Табличные данные ####

# В рамках R табличные данные могут быть представлены абсолютно
# разными способами - матрицы, тибблы, вектора векторов... 
# Однако, наиболее удобным для понимания и работы представляются
# датафреймы. Если вы вспомните предыдущее домашнее задание, то
# вы уже знакомились с датафреймом "mtcars".

# Помимо того, что можно пользоваться встроенными наборами данных
# (что, безусловно, полезно в обучающих целях), можно работать со
# своими готовыми таблицами. Наиболее простой формат таблицы, 
# которые можно импортировать в R - CSV - comma separated values.
# Для того, чтобы импортировать такую таблицу в R необходимо 
# воспользоваться функцией read.csv()

# ссылка на скачивание таблицы: 
# https://vincentarelbundock.github.io/Rdatasets/csv/openintro/babies.csv
# добавьте эту таблицу в свою рабочую директорию

df <- read.csv('babies.csv')

# В виду того, что на разных операционных системах (и использованием
# разных языков системы) такой формат может слегка отличаться, 
# рекомендую почитать справку по этой функции (предварительно, открыв
# этот файл в блокноте, чтобы явно взглянуть на его структуру):

?read.csv  # Подсказка - обратите внимание на параметры dec и sep

# Помимо того, что у датафреймов есть строки и столбцы, у них ещё есть
# отдельные элементы - названия столбцов, и, далеко не всегда, но
# названия строк. Эти элементы являются векторами.
# Для того, чтобы обратиться к названиям столбцов нужно использовать
# функцию names(), либо colnames()

names(df)

# Так как эти названия являются векторами - над ними можно производить
# любые операции, которые можно делать с векторами и которые мы с вами
# разобрали раньше

names(df)[3] <- 'ВЕС РЕБЁНКА'
names(df)[names(df)=='case'] <- 'СЛУЧАЙ'

names(df)

# Для того, чтобы обращаться к конкретным столбцам нашей таблицы, можно
# воспользоваться либо их порядковым номером:

df[,1]     # Порядковый номер нужно указывать ПОСЛЕ запятой
df[,2]     

# Чтобы обратиться к конкретной строке также можно воспользоваться её порядковым
# номером

df[1,]     # Порядковый номер нужно указывать ДО
df[2,]

# Если вы напишите какие-то число и ДО и ПОСЛЕ запятой, то вы обратитесь к 
# конкретной ячейке, буквально указав её координаты

df[3,4]

# Помимо того, что к столбцам можно обращаться с помощью их индексов,
# удобнее использовать их названия. Делается это с помощью символа $

df$parity

# Чтобы добавить новый столбец, нужно, прежде всего, что-то в него записать
# например, вектор значений, либо результат выполнения какой-либо функции.
# А также дать ему название также используя символ $

df$STOLBEC <- 1:1236     # Столбца с таким названием у меня нет. Я буквально его добавил

df$`КУРИТ ИЛИ НЕТ` <- ifelse(df$smoke==1,'Курит', 'Не курит')

# Практически в 100% случаев вы работаете с таблицами в MS Excel. Как минимум, вы их там 
# формируете. Для того, чтобы импортировать их в R я, всё же, рекомендую сохранять их в формате
# csv, однако, также имеется возможно открыть непосредственно таблицу в формате .xlsx (.xls)
# Для этого вам понадобится установить библиотеку "readxl"

install.packages('readxl') # Достаточно выполнить эту строку один единственный раз
 		           # Если вы выключите компьютер и включите его заново, то
			   # установленные библиотеки никуда не потеряются!

# После установки необходимо будет эту библиотеку подгрузить в R с помощью функции library()

library(readxl)

# Чтобы открыть необходимую таблицу необходимо воспользоваться функцией из этой библиотеки - 
# read_xlsx() (или read_xls(), в зависимости от формата)

df2 <- read_xlsx('babies.xlsx')

# Также, рекомендую ознакомиться с параметрами данной функции (?read_xlsx)

На данном этапе, если в ваших таблицах имеются пропущенные данные, вы можете
либо заменить пропуски в своих столбцах, как я показывал ранее на примере
вектора x (справедливо только для столбцов с непрерывными данными)
Либо, можете воспользоваться функцией na.omit() с которой вы уже знакомы
и она удалит строки с пропущенными значениями

df <- na.omit(df)

## Преобразование данных

hist(df$gestation)

#       logarithmic
# log() делает данные более линейным, может смещать распределение влево
# Уравнивает дисперсии выборок
# "Боится" нулей, поэтому рекомендуется прибавлять единицу 

df$log_gestation <- log(df$gestation + 1)#
hist(df$log_gestation)

#       square root

df$sqrt_gestation <- sqrt(df$gestation)
hist(df$gestation)
hist(df$sqrt_gestation)


#       обратное преобразование
df$rev_gestation <- 1/(df$gestation + 1)
hist(df$gestation)
hist(df$rev_gestation)

#       возведение в степень (в квадрат)
df$sq_gestation <- df$gestation**2
hist(df$gestation)
hist(df$sq_gestation)

#       logistic


#### Центральные моменты

# Пожалуйста, изучите 4 главу (параграф 4.1) основного учебника, чтобы
# облегчить понимание следующих строк. Либо, если тяжело с английским
# можете ознакомиться с материалом по ссылке: 
# https://olegtalks.ru/tpost/td8yoxf0r1-kak-ponyat-yaschik-s-usami-boxplot-polno?ysclid=mfv2g532kw150143326
# Там примеры приведены на Python, но теоретическая часть неплохая

# mean()         - среднее значение
# median()       - медианное значение
# modeest::mlv() - модальное значение

	# modeest - не встроенная библиотека. Попробуйте установить
	# её с помощью install.packages
	# 
	# Если с установкой библиотеки возникают проблемы (что скорее
	# будет с вероятностью 99%, то можно попробовать "вытащить" 
	# модальное значение из функции density() (см. ниже)

mean(df$weight, na.rm = T)  # 119.5769
median(df$weight, na.rm = T) # 120
modeest::mlv(df$weight, na.rm = T) # 115

hist(df$weight, freq = F) # Параметр freq переводит ось Y из частоты встречаемости
			  # в "вероятность"
		
dx <- density(df$weight)             # Расчитывает плотность вероятности каждого случайного числа
lines(dx$x, dx$y, col = 2, lwd = 2)  # "Наслаивает" график плотности вероятности
				     # на исходную гистограмму


abline(v = mean(df$weight, na.rm = T), col = 'red', lwd = 2)
abline(v = median(df$weight, na.rm = T), col = 'green', lwd = 2)
abline(v = mlv(df$weight, na.rm = T),
       col = 'blue', lwd = 2)


var(df$weight, na.rm = T)
sd(df$weight, na.rm = T)
sqrt(var(df$weight, na.rm = T))

boxplot(df$weight, horizontal = T)     # horizontal = T - для облегчения восприятия (на первых этапах)
abline(v = median(df$weight, na.rm = T), col = 'green', lwd = 2)
abline(h = mean(df$weight, na.rm = T), col = 'red', lwd = 2)
abline(h = mlv(df$weight, na.rm = T), col = 'blue', lwd = 2)

boxplot.stats(df$weight)
# boxplot(boxplot.stats(df$weight)$stats)

abline(h = median(df$weight, na.rm = T), col = 'green', lwd = 2)
abline(h = mean(df$weight, na.rm = T), col = 'red', lwd = 2)
abline(h = mlv(df$weight, na.rm = T),
       col = 'blue', lwd = 2)


weight <- df$weight[!df$weight %in% boxplot.stats(df$weight)$out] # Попробуем отфиьтровать аутлаеры (выбросы)
								  # Не всегда требуется, но, почему бы и нет

boxplot(weight)


try <- quantile(na.omit(df$weight), 
         probs = c(0, 0.25, 0.5,0.75,1))  # Расчёт квартилей. Для понимания, попробуйте нанести их
					  # на boxplot


##########################################   ДОМАШНЕЕ ЗАДАНИЕ   ################################################
#    													                                                       #
#   0. Найти подходящую таблицу на сайте: https://vincentarelbundock.github.io/Rdatasets/datasets.html         #
#   1. Удалить пропуски (если требуется)       								                                   #
#      1.1. Если пропусков слишком много, заменить их средними значениями                                      #
#   2. С помощью ifelse() (или if() и else()) заменить значения в любом столбце 		                       #
#   3. Придумать, как посчитать моду (если пакет modeest не установился)                                       #
#   4. Посчитать моду по 3 столбцам                                                                            #
#   5. Нарисовать boxplot'ы по 3 столбцам                                                                      #
#   6. Линиями обозначить mean, median, mode                                                                   #
#   7. Гистограммы с графиком плотности (+ пункт 6)                                                            #
#                                                                                                              #
################################################################################################################


## Критерии для выбора таблицы: 
1. Побольше строк (от 100 и больше)
2. Побольше столбцов (минимум 10)
3. Хотя бы половина столбцов - числовые, непрерывные
4. Хотя бы 3-4 факторных столбца
5. Столбцы с остальными типами данных - по желанию
