#### NORMALITY TEST ####

# На прошлом занятии мы с вами разбирали, как визуально (самым простым способом)
# можно понять, насколько распределение данных соответствует нормальному.
# В этот раз дополним визуальные методы одним более точным (если можно так 
# выразиться) визуальным методом, а также разберём конкретные статистические
# тесты
# 
# Более точный визуальный метод проверки распределения на нормальность - 
# квантиль-квантильный график (QQ-plot). Как вы должны помнить (из лекции) 
# - QQplot позволяет визуально оценить отклонение данных от теоретического. 
# Чтобы построить такой график потребуется всего лишь две функции:
  
qqnorm(df$weight)
qqline(df$weight)

# По моим данным получилось, что точки не "ложатся" на прямую, соответственно,
# я делают вывод, что данные распределены, скорее всего, не нормально. Для того,
# чтобы показать вам, что имеется ввиду, посмотрите на следующий график, построенным
# по дата фрему mtcars

qqnorm(mtcars$disp)
qqline(mtcars$disp)

### TESTS ###

# Прежде чем перейдём к статистическим тестам, позволю себе небольшую ремарку.
# Далее, у вас может возникнуть путаница между словами "тест" и "критерий".
# Фактически, я не буду проводить между ними разницу, однако стоит помнить, что 
# статистический критерий - конкретное математическое правило, статистический
# тест - процедура, направленная на проверку гипотез с использованием конкретного
# критерия
# 
# Самый простой (математически и фактически) - t-критерий. Чаще всего используется
# t-критерий Стьюдента, однако, забегая немного вперёд, он используется для
# сравнения средних значений в двух выборках и при довольно специфичных условиях.
# В реальности же, данных критерий можно использовать как своего рода проверку
# на нормальность, используя для сравнения фактическое среднее значение выборки.
# К тому же, в 99,9999.... процентов случаев вы будете пользоваться не t-критерием
# Стьюдента, а t-критерием Уэлча, т.к. он не чуствителен к неравенству дисперсий, но
# об этом позже

# Из лекции вы должны помнить, что статистические тесты используются для того,
# чтобы понять принимать ли альтернативную гипотезу (Н1) или же оставаться при своём
# и быть уверенным в нулевой гипотезе (Н0). По простому: НО - данные не отличаются,
# Н1 - данные отличаются. Переводя данные гипотезы на язык проверки на нормальность:
# Н0 - данные распределены нормально, Н1 - данные распределены не нормально.
# Как понять, какой гипотезе "доверять"? Для этого существует p-value - probability
# value. В мировой науке (а также в аналитике данных и прочих областях жизни, где
# требуется статистический анализ) используется 95% интервал. Это значит, что
# вы закладываете в свои данные 5% на то, что они скорее всего какие-то неправильные.
# P-value существует для того, чтобы демонстрировать, является ли результат
# конкретного теста статистически значимым (p-value < 0.05 (или p-value < 5%))
# или нет (p-value >= 0.05)

# Чтобы использовать t-критерий для проверки выборки на нормальность воспользуемся
# функцией t.test()

t.test(df$weight, mu = median(df$weight))

# При проверке на нормальность с помощью t-теста необходимо указывать параметр
# mu - то среднее значение, которое мы считаем. Для верности, укажем медианное

# По моим данным получилось следующее:
  
#       One Sample t-test
# 
# data:  df$weight
# t = 5.7486, df = 1173, p-value = 1.146e-08
# alternative hypothesis: true mean is not equal to 125
# 95 percent confidence interval:
#   127.2914 129.6660
# sample estimates:
# mean of x 
# 128.4787 
  
# P-value получилось равным 1.146e-08. Это значит, что p-value = 1.146 в степени
# -8. Понятно, что данное значение намного меньше, чем 0.05. 
# Следовательно, я могу сделать вывод, что данные 
# распределены НЕ нормально (принимаем альтернативную гипотезу). Чтобы не 
# запутаться, зачастую при выполнении тестов альтернаятивная гипотеза 
# выводится в консоль

# Помимо специфического (для данной задачи) t-теста существуют и более классические,
# в частности, тест Шапиро-Уилка. Этот тест проверяет соответствие выборочных
# квантилей теоретическим квантилям
  
shapiro.test(df$weight)

# В моём случае, p-value опять получилось гораздо меньше, чем 0.05. В рамках данного
# теста H0 - данные распределены нормально, Н1 - данные распределены НЕ
# нормально. Делаем вывод, что второму из двух проведённх тестов распределение
# моих данных не соответствует нормальному. 

# Попробуем ещё один тест, который являлся одним из родоначальников всех критериев
# проверки распределения данных на нормальность - тест Харке-Бэра. Для этого вам
# необходимо установить библиотеку tseries. Эта библиотека будет также крайне 
# полезна, если мы с вами доберёмся до особого типа данных - временных серий.
# Этот критерий хорош тем, что для проверки на нормальность использует такие
# показатели распределения, как ассиметрия и эксцесс. Однако, в сравнении с многими
# другими критериями он обладает довольно "слабой" статистической силой.

library(tseries)

jarque.bera.test(df$weight)

# И вновь, по мои данные распределены НЕ нормально. P-value < 0.05.

# ... И опять я о своём ... Чтобы облегчить себе жизнь и не путаться со всеми
# этими числами и просто мгновенно понимать, как распределены данные мы можем
# самостоятельно написать функцию, которая исходя из результатов выполнения
# теста на нормальность будет говорить, как распределены данные

# Общий вид написаняия своей собственной функции:
  
название_функции <- function(переменные){
  тело_функции
}

# Напишем функцию, которая будет выполнять тест Шапиро-Уилка и говорить, как
# распределены данные

normality <- function(data){
  ifelse(shapiro.test(data)$p.value < 0.05, 'НЕ НОРМАЛЬНО', "НОРМАЛЬНО")
}

## Нотация ...$p.value показывает, что значения p-value существуют внутри 
## объекта (результата выполнения функции) самостоятельно и к ним можно
## обращаться напрямую.

# Проверим её работоспособность:
  
normality(df$weight)

# В моём случае, результат получился "НЕ НОРМАЛЬНО".
# Функцию можно усложнить, например, указать, а какой статистический тест
# использовать для проверки на нормальность. Пусть это будет что-то одно на выбор:
# тест Шапиро-Уилка либо тест Харке-Бэра

normality2 <- function(data, test_type){
  if (test_type == 'shapiro'){
    ifelse(shapiro.test(data)$p.value < 0.05, 'НЕ НОРМАЛЬНО', "НОРМАЛЬНО")
  } else {
    if (test_type == 'jarque'){
      ifelse(jarque.bera.test(data)$p.value < 0.05, 'НЕ НОРМАЛЬНО', "НОРМАЛЬНО")
    } else {
      print('Use on of this: shapiro, jarque')
    }
  }
}

normality2(df$weight, 'shapiro')
normality2(df$weight, 'jarque')


###### ДОМАШНЕЕ ЗАДАНИЕ ###### 
# 1. Используя функцию describe (пакет psych) сформировать таблицы с описательной статистикой
#    всех столбцов в ваших таблицах по заданным группам (используйте цикл for). Если групповой
#    переменной нет (либо уровней фактора меньше 3) - создайте её самостоятельно (сut).
# 2. Напишите функцию, которая по p-value делает вывод о нормальности/не нормальности 
#    распределения и выводит t-значение для t-критерия и X-squared значение для критерия
#    Харке-Бэра.

#### HINT ####
# Попробуйте записать результат выполнения критерия в переменную и посмотрите на то, что в этой 
# переменной хранится. Можете просто к названию переменной с результатом приписать символ $ и 
# посмотреть, что будет в выпадающем окне
