# Подгружайте свои данные и продолжаем работу

df <- read.csv('babies.csv')
df <- na.omit(df) # Если требуется

#### SUMMARY STATISTICS ####

# Термин "описательная статистика" подразумевает под собой расчёт некоторых
# статистических показателей, которые, так или иначе будут описывать распределение
# данных. В частности, вы можете помнить такие показатели, как среднее, медиана,
# квартили и т.д.
# Конечно, можно пользоваться только отдельными функциями для каждого отдельного
# вектора значений, но это будет занимать кучу времени. Для того и существует 
# R, чтобы облегчить нашу многотрудную жизнь. Прежде всего, опробуем функцию
# sapply(). sapply - одна из множества функций семейства "apply" - самая простая
# в использовании. Simplify and apply. Общий вид:
# 
#     sapply(набор_данных, применяемая функция)
#
# Для использования достаточно указать нужную таблицу и функцию, которую
# нужно применить к каждому столбцу

sapply(df, mean) 
sapply(df, median)

# Вы можете обратить внимание, что результат (конкретные числа) разных функций 
# округляются по-разному. Чтобы округлить число нужным вам образом воспользуйтесь
# функцией round(). Общий вид:
# 
#     round(вектор_данных, кол-во_знаков_после_запятой)

round(sapply(df, mean), 3)    # округляет до трёх знаков
round(sapply(df, mean), 1)    # округляет до одного знака


# Помимо функции sapply() для более подробного описания распределения данных
# в "один подход" можно воспользоваться функцией summary(), которая определит
# квартили и среднее значения распределения. Если на вход функции подать 
# таблицу, то она расчитает вышеуказанные показатели для каждого столбца

summary(df$weight)
summary(df)

# Может возникнуть ситуация, когда нужно наглядно понять, например, среднее значение
# какого-либо распределения и стандартное отклонение. Для этого воспользуемся функциями
# paste() и paste0()
# По сути, эти функции способны сделать буквенный элемент из всего, что ваша душа
# пожелает. Только функция paste сделает это с пробелами, а функция paste0 без 
# пробелов

paste(mean(df$weight), '±', sd(df$weight))
paste0(mean(df$weight), '±', sd(df$weight))

# Не забываем про функцию round

paste(round(mean(df$weight), 2), '±', round(sd(df$weight), 2))
paste0(round(mean(df$weight), 2), '±', round(sd(df$weight), 2))

# Периодически, может возникнуть надобность посчитать такой показатель, как
# коэффициент вариации (CV) - относительный показатель разброса данных, в 
# рамках которого стандартное отклонение выражается как процент от среднего
# Также, для удобства расчёта для всех столбцов таблицы воспольуемся функцией
# colMeans(), которая считает средние значения по каждому столбцу.

100*sapply(df, sd)/colMeans(df) 

# Помимо вывода полученных результатов в консоль, мы можем создавать для этих
# результатов отдельные таблицы. Так анализировать полученные результаты
# гораздо нагляднее. Воспользуемся функцией data.frame(). Общий вид:
#     
#     data.frame(название1 = данные1, название2 = данные2 ...)

desc_stat <- data.frame(Mean = colMeans(df),
                        CV = 100*sapply(df, sd)/colMeans(df) )

# У нас создалась таблица, в которой названия строк - названия столбцов в 
# анализируемой таблице. Второй столбец - Mean - средние значения по каждому
# столбцу исходной таблицы. Третий столбец - CV - коэффициент вариации 
# Но помните - R - язык программирования, созданные для задач статистической
# обработки данных и было бы странно, если бы для него не было написано
# конкретных решений для расчёта описательных статистик. 
# Чтобы облегчить себе жизнь вам необходимо установить библиотеку 
# psych (очень полезная библиотека, "джентельменский набор" каждого человека,
# который анализирует данные в R) и воспользоваться функцией describe()

install.packages('psych')   # Достаточно выполнить эту строку один раз.
                            # После закрытия RStudio библиотека останется
                            # установленной 

library(psych)

# Чтобы понять, какие параметры я использовал (и для чего) в данной функции
# воспользуйтесь справкой: ?describe

describe(df, skew = T, quant = c(0.025, 0.25, 0.5, 0.75, 0.972))

# Результат выполнения функции можно сохранить как таблицу с помощью функции
# as.data.frame (перезапишем уже имеющуся таблицу):
  
desc_stat <- describe(df, skew = T, quant = c(0.025, 0.25, 0.5, 0.75, 0.972))

# На примере использования функции describe есть смысл ознакомить вас с циклизацией.
# В частности, с использованием цикла for. 
# Представим, что в ваших данных имеются групповые переменные (а они должны быть).
# Чтобы не писать функцию describe() несколько раз для каждой исследемой группы
# как в примере ниже:

describe(df[df$smoke==1,], skew = T, quant = c(0.025, 0.25, 0.5, 0.75, 0.972))
describe(df[df$smoke==0,], skew = T, quant = c(0.025, 0.25, 0.5, 0.75, 0.972))

# (в моих данных группирующая переменная представляет себя и бинарную, поэтому
# пример получился не очень эффектным). Чтобы он стал эффектнее, создадим 
# факторную переменную на основе любой имеющейся:

df$groups <- cut(df$weight, breaks = 10, labels = c(1:10))

# Соответственно, попытка использования функции describe для всех 10 имеющихся
# групп будет выглядеть следующим образом:
  
describe(df[df$groups==1,], skew = T, quant = c(0.025, 0.25, 0.5, 0.75, 0.972))
describe(df[df$groups==2,], skew = T, quant = c(0.025, 0.25, 0.5, 0.75, 0.972))
describe(df[df$groups==3,], skew = T, quant = c(0.025, 0.25, 0.5, 0.75, 0.972))
describe(df[df$groups==4,], skew = T, quant = c(0.025, 0.25, 0.5, 0.75, 0.972))
...
describe(df[df$groups==10,], skew = T, quant = c(0.025, 0.25, 0.5, 0.75, 0.972))

# Общий вид цикла for выглядит следующим образом:

i = 1   # Ни к чему не обязывающая строка, просто создаём "итератор" для облегчения
        # написания цикла

for(указание_конкретных_данных){
  перечисление_действий
}

# Сделаем так, чтобы функция describe выбирала одну из имеющихся десяти групп
# в моих данных. Также, будем записывать полученные таблицы с описательными
# статистиками не просто в какую-то переменную, а непосредственно в свою рабочую
# директорую с помощью функции write.csv()

i = 1
for (i in unique(df$groups)){ # i будет принимать значения от 1 до 10
  temp <- subset(df, df$groups == i) # Функция subset создаёт "поднабор" данных
                                     # Будем записывать этот поднабор в отдельную
                                     # таблицу, которая будет меняться в зависимости
                                     # от того, чему равен i
  write.csv(describe(temp, skew = T), 
            paste0('descr_stat_', i, '_group'))
}

# Обратите внимание на функцию write.csv. Первым параметром мы указали результат
# выполнения функции describe, вторым параметром - название файла, которое генерируется
# с использованием конкретного значения i с помощью функции paste0
# После выполнения цикла обратите внимание на свою рабочую директорию. Там появились
# новые файлы!
